Revit 2026 API

# FabricationMaterialType Enumeration

---

An enumerated type listing all fabrication material types.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FabricationMaterialType
```
```vb
Public Enumeration FabricationMaterialType
```
```cpp
public enum class FabricationMaterialType
```
```fsharp
type FabricationMaterialType
```

| Member name | Value | Description |
| --- | --- | --- |
| Containment | 3 | Containment material type (index/specification name) |
| Ductwork | 1 | Flatbed material type (thickness/wire gauge) |
| Pipework | 2 | Pipework material type (index/specification name) |
| Unknown | 0 | Unknown material type |

#### Reference

Autodesk.Revit.DB Namespace